 77    CTS01            PIC 9(4) VALUE ZERO.#NUM#4#0
 77    CTD01            PIC 9(4) VALUE ZERO.#NUM#4#0
 77 CTE01     PIC  9(4)  VALUE ZERO.#NUM#4#0
 77 CTE02     PIC  9(4)  VALUE ZERO.#NUM#4#0
 77 CTE03     PIC  9(4)  VALUE ZERO.#NUM#4#0
 77 CTS01     PIC  9(4)  VALUE ZERO.#NUM#4#0
 77 CTS02     PIC  9(4)  VALUE ZERO.#NUM#4#0
 77   IND01 PIC 99 VALUE 0.#NUM#2#0
  77   BLANC10 PIC X(10) VALUE SPACES.#ALN#10#''
  77   BLANC10    PIC X(10) VALUE SPACES.#ALN#10#''
 77   IND01 PIC 99 VALUE 0.#NUM#2#0
 77  CTA01  PIC 9(8) VALUE 0.#NUM#8#0
 77  CTA02  PIC 9(8) VALUE 0.#NUM#8#0
 77  CTE01  PIC 9(8) VALUE 0.#NUM#8#0
 77  CTE02  PIC 9(8) VALUE 0.#NUM#8#0
 77  CTE03  PIC 9(8) VALUE 0.#NUM#8#0
 77  CTE05  PIC 9(8) VALUE 0.#NUM#8#0
 77  W-TOT  PIC 9(12)V99 VALUE 0.#FLOAT#14#0#2
 77  W-TOT-EMELH PIC 9(12)V99 VALUE 0.#FLOAT#14#0#2
 77  W-TOT-EME90 PIC 9(12)V99 VALUE 0.#FLOAT#14#0#2
 77  W-TOT-EMHLH PIC 9(12)V99 VALUE 0.#FLOAT#14#0#2
 77  W-TOT-EMH90 PIC 9(12)V99 VALUE 0.#FLOAT#14#0#2
 77  W-ANO PIC 9 VALUE 0.#NUM#1#0
 77  CTL PIC 9(6) VALUE ZERO.#NUM#6#0
 77  CTDEJAMOD PIC 9(6) VALUE ZERO.#NUM#6#0
 77  CTERR PIC 9(6) VALUE ZERO.#NUM#6#0
 77  CTMOD20 PIC 9(6) VALUE ZERO.#NUM#6#0
 77  CTMOD60 PIC 9(6) VALUE ZERO.#NUM#6#0
 77  OK PIC 9 VALUE ZERO.#NUM#1#0
 77  KO PIC 9 VALUE ZERO.#NUM#1#0
 77  IX PIC S99 COMP VALUE 0.#SNUM#2#0
 77  KERIB PIC 99.#NUM#2#None
 77  NLIG PIC S99 COMP VALUE 80.#SNUM#2#80
 77  AIG PIC S9 COMP VALUE 0.#SNUM#1#0
 77  PRECED PIC X VALUE " ".#ALN#1#" "
 77  NPAG PIC 9999 VALUE 0.#NUM#4#0
 77  IX PIC S99 COMP VALUE 0.#SNUM#2#0
 77  KERIB PIC 99.#NUM#2#None
 77  CTR PIC 9 VALUE 0.#NUM#1#0
 77  KERIB PIC S99V99.#SFLOAT#4#None
 77  KERIB PIC S9(3)V99.#SFLOAT#5#None
