01                 SA34.                                         PAD73F
      10       FILLER         PICTURE  X(00060).                  PAD73F
      10            SA34-PRECNA PICTURE  9(3).                    PAD73F
      10            SA34-ZASEI.                                   PAD73F
      11            SA34-CNAACA PICTURE  99.                      PAD73F
      11            SA34-INSEI  PICTURE  9(5)V999.                PAD73F
      11            SA34-ZSUSEI.                                  PAD73F
      12            SA34-CSUSA  PICTURE  99.                      PAD73F
      12            SA34-DSUSPA PICTURE  9(8).                    PAD73F
      12            SA34-MTSUSA PICTURE  9(8)V99.                 PAD73F
      11            SA34-CAFSSA PICTURE  9.                       PAD73F
      11            SA34-COIMPA PICTURE  9.                       PAD73F
      11            SA34-COCRIA PICTURE  9.                       PAD73F
      11            SA34-DJOUA  PICTURE  9(8).                    PAD73F
      11            SA34-DEXPIA PICTURE  9(8).                    PAD73F
      10            SA34-ZMAJEI.                                  PAD73F
      11            SA34-CNAACB PICTURE  99.                      PAD73F
      11            SA34-INMEI  PICTURE  9(5)V9(3).               PAD73F
      11            SA34-ZSUMEI.                                  PAD73F
      12            SA34-CSUSB  PICTURE  99.                      PAD73F
      12            SA34-DSUSPB PICTURE  9(8).                    PAD73F
      12            SA34-MTSUSB PICTURE  9(8)V99.                 PAD73F
      11            SA34-CAFSSB PICTURE  9.                       PAD73F
      11            SA34-COIMPB PICTURE  9.                       PAD73F
      11            SA34-COCRIB PICTURE  9.                       PAD73F
      11            SA34-DJOUAB PICTURE  9(8).                    PAD73F
      11            SA34-DEXPIB PICTURE  9(8).                    PAD73F
      10       FILLER         PICTURE  X(00139).                  PAD73F
 01                 SA35.                                         PAD73F
      10       FILLER         PICTURE  X(00060).                  PAD73F
      10            SA35-PRECNA PICTURE  9(3).                    PAD73F
      10            SA35-ZSURP.                                   PAD73F
      11            SA35-CNAACA PICTURE  99.                      PAD73F
      11            SA35-NBDEG  PICTURE  9(3).                    PAD73F
      11            SA35-ZSUSUR.                                  PAD73F
      12            SA35-CSUSA  PICTURE  99.                      PAD73F
      12            SA35-DSUSPA PICTURE  9(8).                    PAD73F
      12            SA35-MTSUSA PICTURE  9(8)V99.                 PAD73F
      11            SA35-CAFSSA PICTURE  9.                       PAD73F
      11            SA35-COIMPA PICTURE  9.                       PAD73F
      11            SA35-COCRIA PICTURE  9.                       PAD73F
      11            SA35-DJOUA  PICTURE  9(8).                    PAD73F
      11            SA35-DEXPIA PICTURE  9(8).                    PAD73F
      10            SA35-ZALVA.                                   PAD73F
      11            SA35-CNAACB PICTURE  99.                      PAD73F
      11            SA35-INGVA  PICTURE  9(5)V999.                PAD73F
      11            SA35-ZSUSVA.                                  PAD73F
      12            SA35-CSUSB  PICTURE  99.                      PAD73F
      12            SA35-DSUSPB PICTURE  9(8).                    PAD73F
      12            SA35-MTSUSB PICTURE  9(8)V99.                 PAD73F
      11            SA35-CAFSSB PICTURE  9.                       PAD73F
      11            SA35-COIMPB PICTURE  9.                       PAD73F
      11            SA35-COCRIB PICTURE  9.                       PAD73F
      11            SA35-DJOUAB PICTURE  9(8).                    PAD73F
      11            SA35-DEXPIB PICTURE  9(8).                    PAD73F
      10       FILLER         PICTURE  X(00144).                  PAD73F