        IDENTIFICATION DIVISION.
        PROGRAM-ID. ESSAI1.
        ENVIRONMENT DIVISION.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
          77 MADONNEE PIC X(5).
          77 MANUM PIC 9(5).
        PROCEDURE DIVISION.
             move  '12'  to MADONNEE.
             display MADONNEE.
             move  12  to MADONNEE.
             display MADONNEE.
             move  'e'  to MANUM.
             display MANUM.
             move  'eg'  to MANUM.
             display MANUM.
             
             STOP RUN.


      * 12   
      * 12   
      * 0000e
      * 000eg
      